ox_docs/corners/david/20210831090644-linear_algebra_index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-24 Fri 14:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Linear Algebra Index</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Taproot" />
<link rel="stylesheet" href="https://taproot3.sanity.gq/global.css" type="text/css"/>
<link rel="stylesheet" href="https://raw.githubusercontent.com/PrismJS/prism-themes/master/themes/prism-atom-dark.css" crossorigin="anonymous" referrerpolicy="no-referrer" />
</head>
<body>
<div id="preamble" class="status">
<div>Linear Algebra Index  Taproot 2021-09-24 Fri 13:59</div>
</div>
<div id="content">
<h1 class="title">Linear Algebra Index</h1>
<p>
:ROAM<sub>REFS</sub>: <a href="https://docs.google.com/presentation/d/1rpqDXysh8GJJodXCTbWCj4MmIx87mT_ksyMqHoq-hkk/edit">https://docs.google.com/presentation/d/1rpqDXysh8GJJodXCTbWCj4MmIx87mT_ksyMqHoq-hkk/edit</a>
</p>
<p>
<a href="https://docs.google.com/presentation/d/1rpqDXysh8GJJodXCTbWCj4MmIx87mT_ksyMqHoq-hkk/edit">https://docs.google.com/presentation/d/1rpqDXysh8GJJodXCTbWCj4MmIx87mT_ksyMqHoq-hkk/edit</a>
</p>

<div id="outline-container-org71e56ac" class="outline-2">
<h2 id="org71e56ac"><span class="section-number-2">1</span> Lecture 1&#xa0;&#xa0;&#xa0;<span class="tag"><span class="flow">flow</span></span></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>A vector space is an algebraic structure like a <i>group</i> or <i>field</i>.</li>
<li>\(\mathbb{R}\) is the field of real numbers.</li>
<li>A group is a set and an operation (a two-to-one mapping) where the inputs and outputs are within the set</li>
</ul>
<div class="collapsible" id="orge8ce840">
<p>
You can represent a function with inputs/outputs by using the rows as the number of outputs and the columns as the number of inputs. Here, that would mean a 2x1 matrix.
</p>

</div>
<ul class="org-ul">
<li>Groups do not need to be commutative.</li>
<li>With a second operation, the notion of being <i>distributive</i> is introduced.</li>
<li>Rings are groups with a second operation, but the second operation doesn't have all that the first one does.
<ul class="org-ul">
<li>Integers are an example: group under addition, and then they have multiplication which has identities but not inverses</li>
</ul></li>
<li>Fields are sets that are groups with respect to both operations (i.e. \(\mathbb{R}\))</li>
<li>Field extensions: i.e. \(\mathbb{R}[\sqrt{-1}]\), which is real numbers and real numbers as coefficients of \(i\) (complex numbers).
<ul class="org-ul">
<li>Vectors can technically be thought of as field extension - since complex numbers are it means you can represent numbers in \(\mathbb{R}^2\). This is one possible interpretation of vector multiplication: it's just like multiplying complex numbers.</li>
</ul></li>
</ul>

\begin{align*}
\left[\begin{matrix}
a \\
b \\
\end{matrix}\right]
\left[\begin{matrix}
c\\
d \\
\end{matrix}\right] =
\left[\begin{matrix}
ac - bd \\
ad - bc \\
\end{matrix}\right] \\
(a+b\sqrt{-1})(c+d\sqrt{-1}) = (ac-bd)+(ad-bc)\sqrt{1}
\end{align*}

<ul class="org-ul">
<li>All of this niceness is only really true for 2 dimensions, although it'll work for 4, 8, and 16 (although without zero divisors) as well.</li>
<li>Even though this is great, it isn't generalizable, and this was the motivation for vector spaces.</li>
<li>w:</li>
</ul>
</div>
</div>
<div id="outline-container-orgbfcffe6" class="outline-2">
<h2 id="orgbfcffe6"><span class="section-number-2">2</span> Lecture 2&#xa0;&#xa0;&#xa0;<span class="tag"><span class="flow">flow</span></span></h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgee60340" class="outline-3">
<h3 id="orgee60340"><span class="section-number-3">2.1</span> Linear Combinations</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Linear combinations are part of why we call it <i>linear</i> algebra.
</p>

<div class="defn" id="org53a219b">
<p>
A linear combination of a list \(v_1, ..., v_n\) of vectors in a vector space \(V\) is a vector of the form:
</p>
\begin{equation}
a_1v_1 + ... + a_nv_n
\end{equation}
<p>
where \(a_1, ..., a_n \in \mathbf{F}\).
</p>

</div>
</div>
</div>

<div id="outline-container-orgd1c8dc2" class="outline-3">
<h3 id="orgd1c8dc2"><span class="section-number-3">2.2</span> Spans</h3>
<div class="outline-text-3" id="text-2-2">
<div class="defn" id="org17f3b23">
<p>
The set of all linear combinations of a list of vectors \(v_1, ..., v_n\) in \(V\) is called the <i>span</i> of \(v_1, ..., v_n\). Usually denoted is \(\text{span}(v_1, ..., v_n)\). 
</p>
\begin{equation}
\text{span}(v_1, ..., v_n) = \{a_1v_1 + ... + a_nv_n : a_1 ... a_n \in \mathbf{F}\}
\end{equation}
<p>
Altenratively, the span is the smallest subspace that contains the vectors \(v_1, ..., v_n\). 
</p>

</div>

<p>
One common question associated with spans is what is <i>in</i> a span. Solving equations like following can be challenging:
</p>
\begin{equation}
(13, -1, 6) = a_1 (2,1,-1) + a_2 (1,-2,4) 
\end{equation}
<p>
What would happen if we added a third vector? It'd be like having three equations and three unknowns, and while intuition makes it seem like its always solvable there are special cases where it isn't. 
</p>

<div class="aside" id="orga5cec48">
<p>
This can be solved in a easier fashion than guessing and checking through computational methods, but we're focusing on abstract understanding for now.
</p>

</div>
</div>
</div>

<div id="outline-container-org9c78d56" class="outline-3">
<h3 id="org9c78d56"><span class="section-number-3">2.3</span> Linear Independence</h3>
<div class="outline-text-3" id="text-2-3">
<div class="defn" id="org2bc028c">
<p>
A list \(v_1, ..., v_n\) of vectors in \(V\) is <i>linearly independent</i> if the only choice of coefficients to make \(a_1v_1 + ... + a_nv_n\) equal 0 is \(a_1 = ... = a_n = 0\). Alternatively. this means that there is no way for these vectors to cancel each other out.
</p>

</div>
<p>
n
</p>
<div class="defn" id="org3671d74">
<p>
A list  \(v_1, ..., v_n\) of vectors in \(V\) is <i>linearly dependent</i> if they are not linearly independent: a.k.a. there is a unique (i.e not everything is 0) choice of \(a_1,..,.a_n\) such that \(a_1v_1 + ... + a_nv_n = 0\). Alternatively, this means there is a way for these vectors to cancel each other out.
</p>

</div>

<div class="defn" id="orged1e972">
<p>
Suppose \(v_1, ..., v_n\) is a linearly dependent list in \(V\). There exists a list \(j \in \{1,2,...,m\}\) such that the following hold:
</p>
<ul class="org-ul">
<li>\(v_j \in \text{span}(v_1, ..., v_{j-1}\)</li>
<li>if the \(j^\text{th}\) term is removed from the list , the span of the remaining list equals the span of \(v_1, ..., v_n\)</li>
</ul>

<p>
Essentially, if an element of the list is a linear combination of other elements in a list you can remove it (since it doesn't contribute to the span). 
</p>

</div>

<div class="problem" id="org6d14858">
<p>
Suppose \(v_1, v_2, v_3, v_4\) is linearly independent in \(V\). Prove that the list
</p>
\begin{equation*}
v_1 - v_2, v_2 - v_3, v_3- v_4, v_4
\end{equation*}
<p>
is also linearly independent.
</p>

\begin{align*}
a_1v_1 + a_2v_2 + a_3v_3 + a_4v_4 = 0 \text{ only when } a_1=a_2=a_3=a_4=0 \\
\text{Suppose } b_1(v_1-v_2) + b_2(v_2-v_3) + b_3(v_3-v_4) + b_4(v_4) = 0\\
b_1v_1-b_1v_2 + b_2v_2-b_2v_3 + b_3v_3-b_3v_4 + b_4v_4) = 0\\
b_1v_1- (b_1-b_2)v_2 - (b_2-b_3)v_3 - (b_3-b_4)v_4 = 0 \\
\text{One of $(b_1-b_2), (b_2-b_3), (b_3-b_4) \neq 0$} \\
\text{so $v_1,v_2,v_3,v_4$ is linearly dependent.}
\end{align*}

</div>
</div>
</div>

<div id="outline-container-org386369a" class="outline-3">
<h3 id="org386369a"><span class="section-number-3">2.4</span> Bases</h3>
<div class="outline-text-3" id="text-2-4">
<div class="defn" id="org4da2d86">
<p>
Set of polynomials with coefficients in \(\mathbf{F}\) and degree of most \(n\).
</p>

</div>

<div class="defn" id="org71a993f">
<p>
A <i>basis</i> of \(V\) is a set of vectors in \(V\) that are linearly independent and spans \(V\). Bases are useful because they give a unique representation of a vector as a linear combination of bases.
</p>

<p>
Example: \((0,0,1), (0,1,0), (1,0,0)\) is a basis of \(\mathbf{F}^3\).
Example: The list \((1-1,0), (1,0,-1)\) is a basis of \(\{(x,y,z) \in \mathbf{F}^3 : x + y + z = 0\}\) (sidenote: this is actually a valid subspace because it forms a plane \(z=-x-y\)).
</p>

</div>
</div>
</div>
</div>
</div>
</body>
</html>
